import pandas as pd

df = pd.read_csv('tranzaktions.csv', sep='\t')

agg_func_math = {
    'Цена (млн)': ['sum', 'mean']
}

print('--------------------------------------------------------------------------------------')
print('Сумма и среднее значение всех вырученных средств каждым продавцом по отдельности: ')
print(df.groupby(['Продавец']).agg(agg_func_math).round(2))
print('--------------------------------------------------------------------------------------')

print('--------------------------------------------------------------------------------------')
print('Для каждого продавца сумму и среднее значение вырученных средств при продаже автомобилей, цена которых >= 2 млн: ')
print(df[(df['Цена (млн)'] >= 2)].groupby(['Продавец']).agg(agg_func_math).round(2))
print('--------------------------------------------------------------------------------------')
